[
    {
      "userId": 1,
      "id": 1,
      "title": "Norway Weekend Itineraries",
      "body": "If you’re coming to Norway for just a weekend I’d really recommend sticking to one place. Norway is a big country,public transport doesn’t run that often and can have delays, and moving around to a bunch of places in a short time frame can get expensive.\n That said, you could also consider renting a car and exploring a bit of the area if you can, as the best part of Norway is getting out of the cities and towns and seeing some of the beautiful nature here. Norway is also an easy country to drive in, as there is so little traffic here.\n Though if you get motion sickness definitely bring some tablets or Sea Bands, as the winding roads here can do a number on your stomach! I’ve written a more detailed guide to things to know when planning a road trip in Norway here."
    },
    {
      "userId": 1,
      "id": 2,
      "title": "Oslo",
      "body": "Why? Oslo is fun for locals and the only city in Norway that actually feels like a big city, but there are a lot of other cities in Europe that do what Oslo does best even better. In other words, Oslo is a great city for Norway, but I wouldn’t necessarily consider it one of Europe’s great cities.And that’s totally fine, because Norway isn’t really about cities.Okay, maybe I’m being harsh, and maybe it’s because I’ve received too many messages from people telling me how disappointed by Oslo’s “fjord.” Yes Oslo is technically on a fjord, but if you’re looking for those famous mountainous fjords you’re going to need to head west or north.But if you do have your heart set on Oslo, it does have some great shopping, amazing restaurants, sort of okay nightlife (lol), and lots of museums. You won’t be bored. I’ve written about things to do in Oslo here, the Oslo Christmas markets here, and a guide to finding the best Oslo accommodation for your budget here."
    },
    {
      "userId": 1,
      "id": 3,
      "title": "Rjukan",
      "body": "If you’ve found a cheap flight to Oslo for a weekend trip but now I’ve scared you off spending all your time there, consider spending a night or two in Rjukan! You can book a bus to Rjukan here, but I’d really recommend renting a car if you can, as the drive to Rjukan via Gaustatoppen is truly spectacular.Rjukan is a quirky mountain town with an important World War II history. It’s also listed as a UNESCO Industrial Heritage Site and it’s really cool to see the old factories and worker accommodation.But I also love that it’s at the foot of both Gaustatoppen, one of Norway’s most beautiful mountains, and Hardangervidda, Northern Europe’s largest high mountain plateau (which is also home to Norway’s largest herd of wild reindeer)."
    }
  ]